{
  "extendedIngredients": [
    {
      "originalString": "8 oz of penne pasta (I used Trader Joe's High Fiber Pasta)",

      "amount": 8.0,
      "unit": "oz"
    },
    {
      "originalString": "1/2 Tbsp. basil leaves",
      "amount": 0.5,
      "unit": "Tbsp"
    },
    {
      "originalString": "1/4 tsp. ground pepper",
      "amount": 0.25
    },
    {
      "originalString": "2 cloves garlic, minced",
      "amount": 2.0,
      "unit": "cloves"
    },
    {
      "originalString": "8 tsp. Parmesan cheese",
      "amount": 8.0,
      "unit": "tsp"
    }
  ],
  "title": "Penne Pasta with Broccoli and Cheese",
  "summary": "The recipe Penne Pasta with Broccoli and Cheese can be made <b>in approximately approximately 45 minutes</b>. This recipe serves 4 and costs 64 cents per serving. One serving contains <b>269 calories</b>, <b>13g of protein</b>, and <b>2g of fat</b>. 1 person were glad they tried this recipe. It works well as a very affordable main course. It is brought to you by Foodista. If you have penne pasta, ground pepper, garlic, and a few other ingredients on hand, you can make it. Overall, this recipe earns an <b>outstanding spoonacular score of 94%</b>. Try <a href=\"https://spoonacular.com/recipes/cheesy-broccoli-penne-pasta-547454\">Cheesy Broccoli Penne Pasta</a>, <a href=\"https://spoonacular.com/recipes/whole-wheat-penne-pasta-with-broccoli-rabe-sausage-10333\">Whole Wheat Penne Pasta With Broccoli Rabe & Sausage</a>, and <a href=\"https://spoonacular.com/recipes/broccoli-and-cheese-penne-149657\">Broccoli And Cheese Penne</a> for similar recipes.",
  "instructions": "In a large pot add water and bring to a boil. Add pasta and cook until done, about 6 minutes.\nMeanwhile, heat the broth, basil, black pepper, garlic and broccoli in a large skillet over medium heat bring to a boil. Reduce the heat to low. Cover and cook until the broccoli is tender-crisp.\nAdd the pasta to the broccoli mixture and toss to coat.\nAdd cheese to the pasta mixture\nServe and enjoy!\nMakes 4 servings, about 2 cups or so\nCalories per serving:  235,  Fat:  2.5.  Cholesterol:  5,  Sodium:  138,  Carbs:  40.3,  Fiber:  8.5,  Sugar:  3.3,  Protein:  12"
}